algoritmos/Algoritmos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-18 Thu 13:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Diseño y Análisis de Algoritmos</title>
<meta name="author" content="Erik Rangel Limón" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://cdn.simplecss.org/simple.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Diseño y Análisis de Algoritmos</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6fb2fab">Introuducción</a></li>
<li><a href="#org3c82c5f">Recursos en línea</a>
<ul>
<li><a href="#org371c0ea">Cursos en video</a>
<ul>
<li><a href="#org30b7b17">Curso completo de freeCodeCamp</a></li>
<li><a href="#org5a1e3db">Curso de algoritmos de Abdul Bari</a></li>
<li><a href="#org66f7e30">Repaso sobre el cálculo de complejidad de GeeksgorGeeks</a></li>
</ul>
</li>
<li><a href="#orgdfdadaa">Cursos textuales</a>
<ul>
<li><a href="#org5c88af1">Fundamentos de Algoritmos por GeeksforGeeks</a></li>
<li><a href="#orgd5976f6"><i>DAA Tutorial</i> - Javatpoint</a></li>
<li><a href="#org39c1865"><i>Design and Analysis of Algorithms</i> - Tutorialspoint</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6fb2fab" class="outline-2">
<h2 id="org6fb2fab">Introuducción</h2>
<div class="outline-text-2" id="text-org6fb2fab">
<p>
En la teoría de la complejidad computacional, el diseño y el análisis de algoritmos consituye una parte importante que nos proporciona una estimación teórica de los recursos que se necesitan para resolver una tarea computacional, entre ellos los recursos de tiempo y espacio necesarios para ejecutarlo.
</p>

<p>
En éste artículo documentaremos algunos recursos disponibles que hay en internet en donde podríamos aprender de forma autodidacta un curso sobre análisis de algoritmos.
</p>
</div>
</div>

<div id="outline-container-org3c82c5f" class="outline-2">
<h2 id="org3c82c5f">Recursos en línea</h2>
<div class="outline-text-2" id="text-org3c82c5f">
<p>
A la fecha, es muy fácil encontrar información por internet, y sobre temas como computación no hay excepción. Para esta parte, enlistaremos algunos cursos sobre la materia en dos: cursos o tutoriales en video; y cursos, artículos o guías completas en páginas de internet.
</p>
</div>

<div id="outline-container-org371c0ea" class="outline-3">
<h3 id="org371c0ea">Cursos en video</h3>
<div class="outline-text-3" id="text-org371c0ea">
</div>
<div id="outline-container-org30b7b17" class="outline-4">
<h4 id="org30b7b17">Curso completo de freeCodeCamp</h4>
<div class="outline-text-4" id="text-org30b7b17">
<p>
En un sólo video, de un poco más de 5 horas de duración, de abarca un curso completo sobre Análisis de Algoritmos y Estructuras de Datos.
</p>

<p>
Éste está dividido en tres partes:
</p>

<ol class="org-ol">
<li>Introducción a los Algoritmos.</li>
<li>Introducción a las Estructuras de Datos.</li>
<li>Búsquedas y Ordenamientos.</li>
</ol>


<p>
Más que nada, podemos considerarlo como un repaso sobre lo que se vió en un curso pasado como lo fue en <i>Estructuras de Datos</i>.
</p>

<p>
<a href="https://www.youtube.com/watch?v=8hly31xKli0">Link al video</a>
</p>
</div>
</div>

<div id="outline-container-org5a1e3db" class="outline-4">
<h4 id="org5a1e3db">Curso de algoritmos de Abdul Bari</h4>
<div class="outline-text-4" id="text-org5a1e3db">
<p>
Ésta es una lista de reproducción que consta de 84 videos. Cada video tiene en promedio una duración de 20 minutos, sin embargo, es uno de los cursos más completos en video que podemos encontrar.
</p>

<p>
Da una introducción a los algoritmos y cómo analizarlos, complejidad computacional, notaciones asintóticas, relaciones de recurrencia, y explicaciones del funcionamiento de algoritmos como la raíz cuadrada, ordenamientos, multiplicación de matrices, algoritmos en gráficas, y muchos otros.
</p>

<p>
<a href="https://www.youtube.com/watch?v=0IAPZzGSbME&amp;list=PLDN4rrl48XKpZkf03iYFl-O29szjTrs_O">Link a la lista de reproducción</a>
</p>
</div>
</div>

<div id="outline-container-org66f7e30" class="outline-4">
<h4 id="org66f7e30">Repaso sobre el cálculo de complejidad de GeeksgorGeeks</h4>
<div class="outline-text-4" id="text-org66f7e30">
<p>
En este video recordamos cómo funciona el cálculo de la complejidad de un algoritmo, repasando los ciclos, las secuencias <code>if-else</code>, entre otras.
</p>

<p>
<a href="https://www.youtube.com/watch?v=KXAbAa1mieU">Link al video</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orgdfdadaa" class="outline-3">
<h3 id="orgdfdadaa">Cursos textuales</h3>
<div class="outline-text-3" id="text-orgdfdadaa">
</div>
<div id="outline-container-org5c88af1" class="outline-4">
<h4 id="org5c88af1">Fundamentos de Algoritmos por GeeksforGeeks</h4>
<div class="outline-text-4" id="text-org5c88af1">
<p>
En ésta página, podremos encontrar un curso bastante completo, dando una introducción a los algoritmos, complejidad, técnicas de diseño, análisis de algoritmos, tipos de algoritmos y su explicación, la importancia y la relación que tienen los algoritmos y las estructuras de datos, y más.
</p>

<p>
<a href="https://www.geeksforgeeks.org/fundamentals-of-algorithms/">Link</a>
</p>
</div>
</div>

<div id="outline-container-orgd5976f6" class="outline-4">
<h4 id="orgd5976f6"><i>DAA Tutorial</i> - Javatpoint</h4>
<div class="outline-text-4" id="text-orgd5976f6">
<p>
Si lo que necesita uno es un curso basto sobre el diseño y el análisis de algoritmos, uno de los recursos mejor documentados sobre el tema, es el que nos provee la página <i>javatpoint</i>, pues comprende un temario extenso y bien explicado
</p>

<p>
<a href="https://www.javatpoint.com/daa-tutorial">DAA Tutorial</a>
</p>
</div>
</div>

<div id="outline-container-org39c1865" class="outline-4">
<h4 id="org39c1865"><i>Design and Analysis of Algorithms</i> - Tutorialspoint</h4>
<div class="outline-text-4" id="text-org39c1865">
<p>
Como una alternativa igual de extensa, también está el curso que proporciona <i>tutorialspoint</i>
</p>

<p>
<a href="https://www.tutorialspoint.com/design_and_analysis_of_algorithms/analysis_of_algorithms.htm">Design and Analysis of Algorithms</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Erik Rangel Limón</p>
<p class="date">Created: 2022-08-18 Thu 13:14</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
